const Home = () => {
    return(
        <div className="Content">
                <h1 className='Title'>Главная</h1>
                <p>
                    Пи́шущая маши́на (разг. прост. совр. «печатная машинка») — механический, электромеханический или электронно-механический прибор, оснащённый набором клавиш, нажатие которых приводит к печати соответствующих символов на носителе (в большинстве случаев это бумага). 
                    Широко использовалась в XIX—XX веках. 
                    В настоящее время пишущие машины по большей части вышли из употребления, их функцию стали выполнять персональные компьютеры, укомплектованные принтерами.
                </p>
                <p>
                    Принцип работы большинства пишущих машин заключается в нанесении символов на бумагу при помощи специальных рычагов, заканчивающихся площадками с металлическими или пластиковыми литерами. 
                    При нажатии соответствующей клавиши рычаг ударяет по пропитанной чернилами ленте, оставляя, таким образом, отпечаток литеры на подводимом листе бумаги. 
                    Перед печатью следующего символа выполняется автоматический сдвиг бумажного листа (а также, как правило, перемещение красящей ленты с целью подставить под литеру свежий её участок). 
                    Для печати нескольких копий одного и того же документа используются листы копировальной бумаги, прокладываемые между обычными бумажными листами.
                </p>
                <p>
                    Если в середине XX века невозможно было представить себе контору организации без пишущей машины, то к началу XXI века лишь небольшое количество традиционных компаний-производителей, 
                    таких как «Смит-Корона», Olivetti, «Адлер-Рояль», «Олимпия», Brother, «Накадзима» и др. продолжало выпуск такого рода устройств, 
                    причём большинство из перечисленных компаний в это время занималось выпуском электронных моделей пишущих машин.
                </p>
                <p>
                    В апреле 2011 закрылся завод по производству пишущих машин в Мумбаи, принадлежавший индийской компании Godrej and Boyce, 
                    что вызвало ряд сообщен-ий в СМИ о закрытии «последнего завода пишущих машинок»[2][3][4], что вскоре было опровергнуто[5][6][7].
                    В ноябре 2012 фабрика Brother выпустила пишущую машину, названную «последней, произведённой в Великобритании»; машина была подарена лондонскому Музею науки[8].
                </p>
                <p>
                    Печать окружает нас и пронизывает все сферы жизни человека. 
                    Вот только всегда ли печать была настолько проста и обыдена? Отнюдь. 
                    Исчезли ли старые агрегаты из нашей жизни? Тоже нет. 
                    Нечто архаичное окружает нас и по сей день, хоть и было завернуто в современные технологии и роботизированные линии, но основополагающие принципы устройства печатных машин не меняются. 
                    Я говорю о типографском деле в его классическом, первозданном виде. 
                    Хотите узнать чуть больше о том, как же создаются любимые Вами журналы или забивающие почтовый ящик бесплатные газеты? 
                    Мир печатных машин намного более разнообразен, чем вы можете ожидать.
                </p>
                <p>
                    Печатная машина — полиграфическое оборудование, предназначенное для нанесения изображений на различные материалы. 
                    Используется для производства разнообразной печатной продукции, в том числе знаков почтовой оплаты (почтовых марок и т. п.).
                </p>
                <p>
                    Печатные машины делятся по способу нанесения печати. 
                    Среди них выделяют офсетные, флексографские, трафаретные печатные машины, машины высокой и глубокой печати. 
                    По способу подачи запечатываемого материала печатные машины делятся на листовые и рулонные.
                </p>
        </div>
    );
}

export default Home;