const DesignFeatures = () => {
    return (
        <div className="Content">
            <h1 className="Title">Конструктивные особенности</h1>
            <h2>Типы конструкции пишущих машинок</h2>
            <p>Большинство конструкций пишущих машинок можно отнести к одному из четырёх основных типов:</p>
            <ul className="DecimalList">
                <li><a className="Link" href="#cylindrical">цилиндрический</a></li>
                <li><a className="Link" href="#lever">рычажный</a></li>
                <li><a className="Link" href="#ball">шаровой</a></li>
                <li><a className="Link" href="#chamomile">«ромашка»</a></li>
            </ul>
            <p>Наибольшее распространение получили рычажно-сегментные пишущие машины и машины с ромашками.</p>
            <p><a name="cylindrical"></a>
                Пишущий цилиндр не получил широкого применения в пишущих машинах.
                С пишущим цилиндром было всего несколько машин: Mignon (1924), Plurotyp (1933), Helios-Klimax (1914), Heady (1921).
            </p>
            <p><a name="lever"></a>
                На пишущих машинах с рычагами отпечаток получается в результате удара по бумаге рычагов, расположенных в шлицах сегмента.
                К машинам с пишущими рычагами относятся машины «Олимпия» (модели «SG», «SGE», «SM», «SF» и т. п.), машины «Адлер» («Adler Gabriele 2000», «Adler Primus», «Adler Tippa» и т. п.),
                машины «Ремингтон» («Remie Scout», «Monarch / Monarch Pioneer», «Remington Rand», и т. п.), машины «Гермес» («Hermes Baby», «Hermes 3000» «Hermes Rocket» и т. п.),
                советские машины («Ятрань», «Любава», «Листвица» и т. п.).
            </p>
            <p><a name="ball"></a>
                Пишущие головки или пишущие шарики ассоциируется с машинами «IBM», потому что в 1961 году впервые появились на машинах этой компании («IBM Selectric»).
                Позднее пишущие головки/шарики использовались и на машинах «Ремингтон» (напр., на модели «Sperry Remington SR 101») и на машинах «Quelle» (напр., на модели «Privileg 910C lift-off»).
                Пишущие шарики удобны, потому что их можно заменять и, таким образом, на одной машине можно печатать несколькими шрифтами.
            </p>
            <p><a name="chamomile"></a>
                Пишущая ромашка — специфический носитель матриц, с которых делается отпечаток (на каждом лепестке ромашки находится один знак).
                Ромашки удобны, потому что легко заменяются, и на одной машине, заменяя одну ромашку другой, можно печатать несколькими шрифтами.
                Пишущие ромашки получили большую популярность и использовались на машинах разных производителей: на машинах «IBM» (напр., на «IBM 3000», «IBM 6787», «IBM 6747» и «Wheelwriter»),
                на машинах «Олимпия» («ES 70-Line», «Carrera», «Mastertype», «Mini-Office» и т. п.), на машинах «Канон» (напр., на моделях «Typestar» и «Typemate»),
                на машинах «Триумф-Адлер» (напр., на моделях «Triumph-Adler Gabriele 150», «Triumph-Adler Junior Electronic»),
                на машинах «Оливетти» (напр., на моделях «ET Compact», «ET Personal» и «Linea»),
                на машинах «Гермес» (напр., на моделях «Toptronic» и «Mediatronic»),
                на машинах других производителей (Samsung SQ, Samsung TW, Brother CE, Brother SX, Brother WP/WPT, Optima SB/SP, Erika 3004 Electronic, Erika 6005/6006, Erika Electronic Portable, Casio 130CE/140CE, Citizen Scribona 10/11/15, Lexmark Wheelwriter).
                В СССР во второй половине 1980-х и в начале 1990-х годов выпускалась машина с лепестковым носителем литер — пишуая машина «Ромашка» (типа «ПЭЛП-305», портативная электронная).
                Ромашка используется только на электронных пишущих машинках.
            </p>
            <p>
                По конструкции существует деление на механические, электрические («электромеханические») и электронные пишущие машинки.
                К механическим, относится, например, «Любава», а к электромеханическим — «Ятрань».
            </p>
            <p>
                Кроме этого, в зависимости от предназначения и габаритов пишущие машины делятся на канцелярские и портативные.
                Канцелярские машины используются, как правило, в стационарных условиях.
                Портативные машинки являются малогабаритными, помещаются в небольшой чемодан типа кейса и предназначаются для людей творческих профессий и тех, кто часто путешествует (это машинки журналистов, писателей, студентов, ученых, коммерсантов и т. д.).
            </p>
            <p>
                Канцелярские и пишущие машинки отличались также числом клавиш (на портативных машинках было меньше клавиш).
                Так, например, на портативных пишущих машинах с русской кириллицей количество клавиш — в зависимости от марки и модели машины — составляло от 42 до 46.
                Уменьшение числа клавиш достигалось за счёт отказа от клавиши с буквой «Ё», использования омографии некоторых букв и цифр
                (вместо цифры «0» могла использоваться буква «О», вместо «3» — «З»), и некоторых других форм практичности и экономии.
                На канцелярских машинках каретки длинные, поэтому на таких машинах печатать можно вдоль широкой стороны листа формата А4 и соответственно на формате А3.
                На портативных машинках каретки были короткими и печатать можно было только вдоль узкой стороны листа формата А4.
            </p>
            <h2>Каретка</h2>
            <p>Устройство каретки пишущей машинки зависит от конструкции печатающего механизма.</p>
            <p>
                В машинке с рычажно-сегментным литероносителем на каретке находится весь механизм протяжки бумаги,
                ширина каретки соответствует ширине области печати, каретка с бумагой перемещается относительно неподвижного печатающего механизма.
                При печати каждого символа каретка сдвигается на одно знакоместо, обычно имеется звонок, сигнализирующий за несколько символов до конца строки.
                В механической печатной машинке возврат каретки производится вручную специальным рычагом, одновременно происходит прогон строки на заданный междустрочный интервал.
                Возврат каретки электрической печатной машинки механизирован и запускается клавишей на клавиатуре.
            </p>
            <p>
                На каретке пишущей машинки с шаровым или ромашковым литероносителем смонтированы печатающий механизм и механизм протяжки красящей ленты.
                Каретка с печатающим механизмом перемещается в пределах габарита пишущей машинки относительно бумаги.
            </p>
            <h2>Бумагопроводящий механизм</h2>
            <p>
                В пишущих машинках используется фрикционная подача бумаги, состоящая из бумагоопорного вала и прижимного валика.
                Бумагоопорный вал обычно имеет ручки для ручной протяжки бумаги.
                Для освобождения бумаги прижимной валик отводится от бумагоопорного рычагом.
                В электронных пишущих машинках заправка бумаги может быть автоматизирована.
            </p>
        </div>
    );
}

export default DesignFeatures;